In [ ]:
pip install sqlalchemy pymysql

Requirement already satisfied: sqlalchemy in d:\anaconda\lib\site-packages (2.0.34)
Requirement already satisfied: pymysql in d:\anaconda\lib\site-packages (1.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in d:\anaconda\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in d:\anaconda\lib\site-packages (from sqlalchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.

Importar datos de una BD(SQL)

In [ ]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine(f"mysql+pymysql://root:nito2403@localhost:3306/bd_covid_data")

In [6]:
df_data = pd.read_sql("SELECT * FROM date_reported", engine)
df_data.head()

,Date_reported,Country_code,Country,WHO_region,New_cases,Cumulative_cases,New_deaths,Cumulative_deaths
0,2020-01-05,AF,Afghanistan,EMRO,NaN,0,NaN,0
1,2020-01-12,AF,Afghanistan,EMRO,NaN,0,NaN,0
2,2020-01-19,AF,Afghanistan,EMRO,NaN,0,NaN,0
3,2020-01-26,AF,Afghanistan,EMRO,NaN,0,NaN,0
4,2020-02-02,AF,Afghanistan,EMRO,NaN,0,NaN,0

In [7]:
df_data.size

543360

In [8]:
print(len(df_data))

67920

In [9]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67920 entries, 0 to 67919
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date_reported      67920 non-null  object
 1   Country_code       67637 non-null  object
 2   Country            67920 non-null  object
 3   WHO_region         62826 non-null  object
 4   New_cases          47299 non-null  float64
 5   Cumulative_cases   67920 non-null  int64
 6   New_deaths         35070 non-null  float64
 7   Cumulative_deaths  67920 non-null  int64
dtypes: float64(2), int64(2), object(4)
memory usage: 4.1+ MB

Limpiar datos

In [10]:
df_data = df_data.dropna(subset=['New_cases'])

In [11]:
print(len(df_data))

47299

Transformaci√≥n de Datos

In [12]:
df_data = df_data[['Date_reported', 'Country_code', 'Country', 'WHO_region']]

In [13]:
print(len(df_data))
df_data

47299

      Date_reported Country_code      Country WHO_region
8        2020-03-01           AF  Afghanistan       EMRO
10       2020-03-15           AF  Afghanistan       EMRO
11       2020-03-22           AF  Afghanistan       EMRO
12       2020-03-29           AF  Afghanistan       EMRO
13       2020-04-05           AF  Afghanistan       EMRO
...             ...          ...          ...        ...
67911    2025-04-06           ZW     Zimbabwe       AFRO
67912    2025-04-13           ZW     Zimbabwe       AFRO
67913    2025-04-20           ZW     Zimbabwe       AFRO
67914    2025-04-27           ZW     Zimbabwe       AFRO
67915    2025-05-04           ZW     Zimbabwe       AFRO

[47299 rows x 4 columns]

Exportar datos a una tabla temporal de SQL

In [15]:
from sqlalchemy import text

with engine.connect() as conn:
    conn.execute(text("""
        CREATE TEMPORARY TABLE cases_tempo (
            `Date_reported` text,
            `Country_code` text,
            `Country` text,
            `WHO_region` text
        );
    """))

In [17]:
df_data.to_sql(
    name='cases_tempo',
    con=engine,
    if_exists='append',
    index=False
)

47299

In [18]:
verification_query = f"SELECT * FROM cases_tempo LIMIT 15"
result = pd.read_sql(verification_query, engine)
print(result)

   Date_reported Country_code      Country WHO_region
0     2020-03-01           AF  Afghanistan       EMRO
1     2020-03-15           AF  Afghanistan       EMRO
2     2020-03-22           AF  Afghanistan       EMRO
3     2020-03-29           AF  Afghanistan       EMRO
4     2020-04-05           AF  Afghanistan       EMRO
5     2020-04-12           AF  Afghanistan       EMRO
6     2020-04-19           AF  Afghanistan       EMRO
7     2020-04-26           AF  Afghanistan       EMRO
8     2020-05-03           AF  Afghanistan       EMRO
9     2020-05-10           AF  Afghanistan       EMRO
10    2020-05-17           AF  Afghanistan       EMRO
11    2020-05-24           AF  Afghanistan       EMRO
12    2020-05-31           AF  Afghanistan       EMRO
13    2020-06-07           AF  Afghanistan       EMRO
14    2020-06-14           AF  Afghanistan       EMRO

    ## Ejercicio 2: Datos de una API

Importar datos de una API

In [2]:
import requests
import pandas as pd

url = "https://rickandmortyapi.com/api/character"
all_characters = []

while url:
    response = requests.get(url)
    data = response.json()
    
    # Extraemos solo name, status y species
    for personaje in data["results"]:
        all_characters.append({
            "name": personaje["name"],
            "status": personaje["status"],
            "species": personaje["species"]
        })
    
    url = data["info"]["next"]
# Convertimos a DataFrame
df = pd.DataFrame(all_characters)

In [20]:
df

             name   status species
0    Rick Sanchez    Alive   Human
1     Morty Smith    Alive   Human
2    Summer Smith    Alive   Human
3      Beth Smith    Alive   Human
4     Jerry Smith    Alive   Human
..            ...      ...     ...
821   Young Jerry  unknown   Human
822    Young Beth  unknown   Human
823    Young Beth  unknown   Human
824   Young Jerry  unknown   Human
825  Butter Robot    Alive   Robot

[826 rows x 3 columns]

Limpiar datos

In [21]:
df.dropna()

             name   status species
0    Rick Sanchez    Alive   Human
1     Morty Smith    Alive   Human
2    Summer Smith    Alive   Human
3      Beth Smith    Alive   Human
4     Jerry Smith    Alive   Human
..            ...      ...     ...
821   Young Jerry  unknown   Human
822    Young Beth  unknown   Human
823    Young Beth  unknown   Human
824   Young Jerry  unknown   Human
825  Butter Robot    Alive   Robot

[826 rows x 3 columns]

Transformar datos

In [22]:
df = df[['name', 'species']]

In [23]:
df

             name species
0    Rick Sanchez   Human
1     Morty Smith   Human
2    Summer Smith   Human
3      Beth Smith   Human
4     Jerry Smith   Human
..            ...     ...
821   Young Jerry   Human
822    Young Beth   Human
823    Young Beth   Human
824   Young Jerry   Human
825  Butter Robot   Robot

[826 rows x 2 columns]

Exportar datos

In [24]:
from sqlalchemy import text

with engine.connect() as conn:
    conn.execute(text("""
        CREATE TEMPORARY TABLE characters_rick (
            name VARCHAR(100),
            species VARCHAR(50)
        );
    """))

In [25]:
df.to_sql(
    name='characters_rick',
    con=engine,
    if_exists='append', 
    index=False
)

826

In [26]:
verification_query = f"SELECT * FROM characters_rick LIMIT 20"
result = pd.read_sql(verification_query, engine)
print(result)

                         name species
0                Rick Sanchez   Human
1                 Morty Smith   Human
2                Summer Smith   Human
3                  Beth Smith   Human
4                 Jerry Smith   Human
5   Abadango Cluster Princess   Alien
6            Abradolf Lincler   Human
7            Adjudicator Rick   Human
8             Agency Director   Human
9                  Alan Rails   Human
10            Albert Einstein   Human
11                  Alexander   Human
12               Alien Googah   Alien
13                Alien Morty   Alien
14                 Alien Rick   Alien
15               Amish Cyborg   Alien
16                      Annie   Human
17              Antenna Morty   Human
18               Antenna Rick   Human
19    Ants in my Eyes Johnson   Human